In [42]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([4,1,-2,4,5],dtype='int64')
obj

0    4
1    1
2   -2
3    4
4    5
dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
obj.values

array([ 4,  1, -2,  4,  5], dtype=int64)

In [6]:
obj2 = pd.Series([1,2,3,4],dtype='float64',index=['a','b','c','e'])
obj2

a    1.0
b    2.0
c    3.0
e    4.0
dtype: float64

In [7]:
obj2.index

Index(['a', 'b', 'c', 'e'], dtype='object')

In [8]:
obj2[obj2>3]

e    4.0
dtype: float64

In [9]:
obj2*2

a    2.0
b    4.0
c    6.0
e    8.0
dtype: float64

In [12]:
'e' in obj2 #Check index

True

In [15]:
sData = {'Ohio': 35000,'Texas':71000,'Oregon':89000,'Utah':98834}
obj3 = pd.Series(sData)
obj3

Ohio      35000
Texas     71000
Oregon    89000
Utah      98834
dtype: int64

In [17]:
obj4 = pd.Series(sData,index=['California','Ohio','Texas'])
obj4

California        NaN
Ohio          35000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Texas         False
dtype: bool

In [20]:
obj4.isnull()

California     True
Ohio          False
Texas         False
dtype: bool

In [21]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon             NaN
Texas         142000.0
Utah               NaN
dtype: float64

In [24]:
obj4.name = 'Population'
obj4

California        NaN
Ohio          35000.0
Texas         71000.0
Name: Population, dtype: float64

In [25]:
obj4.index.name = 'State'
obj4

State
California        NaN
Ohio          35000.0
Texas         71000.0
Name: Population, dtype: float64

In [28]:
obj.index = ['A','B','C','D','E']
obj

A    4
B    1
C   -2
D    4
E    5
dtype: int64

In [29]:
data = {'State': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],'Year': [2000,2001,2002,2001,2002,2003], 'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)
frame

    State  Year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [30]:
frame.head()

    State  Year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [33]:
pd.DataFrame(data, columns=['pop','State','Year','NanValues'])

   pop   State  Year NanValues
0  1.5    Ohio  2000       NaN
1  1.7    Ohio  2001       NaN
2  3.6    Ohio  2002       NaN
3  2.4  Nevada  2001       NaN
4  2.9  Nevada  2002       NaN
5  3.2  Nevada  2003       NaN

In [34]:
frame.columns

Index(['State', 'Year', 'pop'], dtype='object')

In [35]:
frame['Year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: Year, dtype: int64

In [38]:
frame2 = pd.DataFrame(data,index=['one','two','three','four','five','six'])
frame2

        State  Year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2

In [40]:
frame2.loc['three']

State    Ohio
Year     2002
pop       3.6
Name: three, dtype: object

In [41]:
frame2['State']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: State, dtype: object

In [44]:
frame2['debt'] = np.arange(6)
frame2

        State  Year  pop  debt
one      Ohio  2000  1.5     0
two      Ohio  2001  1.7     1
three    Ohio  2002  3.6     2
four   Nevada  2001  2.4     3
five   Nevada  2002  2.9     4
six    Nevada  2003  3.2     5

In [47]:
s1 = pd.Series([1,2,3,5],index=['one','two','three','five'])
frame2['debt'] = s1
frame2

        State  Year  pop  debt
one      Ohio  2000  1.5   1.0
two      Ohio  2001  1.7   2.0
three    Ohio  2002  3.6   3.0
four   Nevada  2001  2.4   NaN
five   Nevada  2002  2.9   5.0
six    Nevada  2003  3.2   NaN

In [49]:
frame2['eastren'] = frame2.State == 'Ohio'
frame2

        State  Year  pop  debt  eastren
one      Ohio  2000  1.5   1.0     True
two      Ohio  2001  1.7   2.0     True
three    Ohio  2002  3.6   3.0     True
four   Nevada  2001  2.4   NaN    False
five   Nevada  2002  2.9   5.0    False
six    Nevada  2003  3.2   NaN    False

In [50]:
del frame2['eastren']

In [52]:
frame2.columns

Index(['State', 'Year', 'pop', 'debt'], dtype='object')

In [54]:
frame2.columns.name = 'State'
frame2

State   State  Year  pop  debt
one      Ohio  2000  1.5   1.0
two      Ohio  2001  1.7   2.0
three    Ohio  2002  3.6   3.0
four   Nevada  2001  2.4   NaN
five   Nevada  2002  2.9   5.0
six    Nevada  2003  3.2   NaN

In [55]:
frame2.index.name = 'Year'
frame2

State   State  Year  pop  debt
Year
one      Ohio  2000  1.5   1.0
two      Ohio  2001  1.7   2.0
three    Ohio  2002  3.6   3.0
four   Nevada  2001  2.4   NaN
five   Nevada  2002  2.9   5.0
six    Nevada  2003  3.2   NaN

In [56]:
frame2.values

array([['Ohio', 2000, 1.5, 1.0],
       ['Ohio', 2001, 1.7, 2.0],
       ['Ohio', 2002, 3.6, 3.0],
       ['Nevada', 2001, 2.4, nan],
       ['Nevada', 2002, 2.9, 5.0],
       ['Nevada', 2003, 3.2, nan]], dtype=object)

In [58]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [59]:
pd.Series([1,2,3],index=labels)

0    1
1    2
2    3
dtype: int64

In [60]:
obj = pd.Series(np.arange(4),index=list('abcd'))
obj

a    0
b    1
c    2
d    3
dtype: int32

In [62]:
obj2 = obj.reindex(list('abcde'))
obj2

a    0.0
b    1.0
c    2.0
d    3.0
e    NaN
dtype: float64

In [63]:
obj3 = pd.Series(['blue','red','yellow'],index=[0,2,4])
obj3

0      blue
2       red
4    yellow
dtype: object

In [64]:
obj3.reindex([0,1,2,3,4,5],method='ffill')

0      blue
1      blue
2       red
3       red
4    yellow
5    yellow
dtype: object

In [66]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','d'],columns=['e','f','g'])
frame

   e  f  g
a  0  1  2
b  3  4  5
d  6  7  8

In [68]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

     e    f    g
a  0.0  1.0  2.0
b  3.0  4.0  5.0
c  NaN  NaN  NaN
d  6.0  7.0  8.0

In [69]:
frame2.reindex(['a','b','c','d','e'],columns=['f','g','e'])

     f    g    e
a  1.0  2.0  0.0
b  4.0  5.0  3.0
c  NaN  NaN  NaN
d  7.0  8.0  6.0
e  NaN  NaN  NaN

In [70]:
obj = pd.Series(np.arange(5),index=list('abcde'))
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [72]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [73]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: int32

In [84]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),index=list('abcd'),columns=list('efgh'))
frame

    e   f   g   h
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [85]:
frame.drop(['c','d'])

   e  f  g  h
a  0  1  2  3
b  4  5  6  7

In [86]:
frame.drop(['g','e'],axis='columns')

    f   h
a   1   3
b   5   7
c   9  11
d  13  15

In [87]:
frame.drop(['g','e'],axis=1)

    f   h
a   1   3
b   5   7
c   9  11
d  13  15

In [89]:
frame

    e   f   g   h
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [90]:
frame.drop(['g','e'],axis='columns',inplace=True)
frame

    f   h
a   1   3
b   5   7
c   9  11
d  13  15

In [91]:
obj = pd.Series(np.arange(4),index=list('abcd'))
obj

a    0
b    1
c    2
d    3
dtype: int32

In [92]:
obj['b']

1

In [93]:
obj[1]

1

In [95]:
obj[:'c']

a    0
b    1
c    2
dtype: int32

In [97]:
obj[:3]

a    0
b    1
c    2
dtype: int32

In [98]:
obj[list('bcd')]

b    1
c    2
d    3
dtype: int32

In [99]:
obj[obj<2]

a    0
b    1
dtype: int32

In [100]:
obj['b':'c']

b    1
c    2
dtype: int32

In [102]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),index=list('abcd'),columns=list('efgh'))
frame

    e   f   g   h
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [103]:
frame['f']

a     1
b     5
c     9
d    13
Name: f, dtype: int32

In [105]:
frame[list('geh')]

    g   e   h
a   2   0   3
b   6   4   7
c  10   8  11
d  14  12  15

In [106]:
frame[:2]

   e  f  g  h
a  0  1  2  3
b  4  5  6  7

In [108]:
frame[frame['g']>5]

    e   f   g   h
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [109]:
frame<5

       e      f      g      h
a   True   True   True   True
b   True  False  False  False
c  False  False  False  False
d  False  False  False  False

In [112]:
frame[frame['g']<5]=0
frame

    e   f   g   h
a   0   0   0   0
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [114]:
frame = pd.DataFrame(data,index=['one','two','three','four','five','six'])
frame

        State  Year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2

In [115]:
frame.loc['one']

State    Ohio
Year     2000
pop       1.5
Name: one, dtype: object

In [116]:
frame.loc[['one','two'],['state','pop']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

     state  pop
one    NaN  1.5
two    NaN  1.7

In [117]:
frame.loc['one',['state','pop']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1017: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return getattr(section, self.name)[new_key]

state    NaN
pop      1.5
Name: one, dtype: object

In [118]:
frame.iloc[2]

State    Ohio
Year     2002
pop       3.6
Name: three, dtype: object

In [121]:
frame.iloc[2,[0,1]]

State    Ohio
Year     2002
Name: three, dtype: object

In [124]:
frame.loc[:'two','State']

one    Ohio
two    Ohio
Name: State, dtype: object

In [126]:
frame.loc[:'two','pop'][frame['pop']<1.6]

one    1.5
Name: pop, dtype: float64

In [127]:
s1 = pd.Series([7.3,-2.5,3.4,1.5], index=list('acde'))
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [128]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4),columns=list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [131]:
df2 = pd.DataFrame(np.arange(20).reshape(4,5),columns=list('abcde'))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [132]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [133]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [134]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [135]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [136]:
df1.reindex(columns=df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [137]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [139]:
df1+s1

      a   b    c     d   e
0   7.3 NaN -0.5   6.4 NaN
1  11.3 NaN  3.5  10.4 NaN
2  15.3 NaN  7.5  14.4 NaN

In [140]:
df1.add(s1)

      a   b    c     d   e
0   7.3 NaN -0.5   6.4 NaN
1  11.3 NaN  3.5  10.4 NaN
2  15.3 NaN  7.5  14.4 NaN

In [141]:
df1.add(s1,axis=1)

      a   b    c     d   e
0   7.3 NaN -0.5   6.4 NaN
1  11.3 NaN  3.5  10.4 NaN
2  15.3 NaN  7.5  14.4 NaN

In [143]:
df1.add(s1,axis=0) #Perform arithmentic operations on rows

    a   b   c   d
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
a NaN NaN NaN NaN
c NaN NaN NaN NaN
d NaN NaN NaN NaN
e NaN NaN NaN NaN

In [144]:
frame = pd.DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah   -1.710557  0.202360  0.560696
Ohio   -0.906407 -0.446376 -0.457290
Texas   0.919223 -1.212885  0.623129
Oregon -1.529371  2.633703  0.167689

In [145]:
np.abs(frame)

               b         d         e
Utah    1.710557  0.202360  0.560696
Ohio    0.906407  0.446376  0.457290
Texas   0.919223  1.212885  0.623129
Oregon  1.529371  2.633703  0.167689

In [146]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.629781
d    3.846589
e    1.080419
dtype: float64

In [147]:
frame.apply(f,axis=0)

b    2.629781
d    3.846589
e    1.080419
dtype: float64

In [148]:
frame.apply(f,axis=1)

Utah      2.271253
Ohio      0.460031
Texas     2.132109
Oregon    4.163074
dtype: float64

In [149]:
f1 = lambda x: '%.2f' %x
frame.applymap(f1)

            b      d      e
Utah    -1.71   0.20   0.56
Ohio    -0.91  -0.45  -0.46
Texas    0.92  -1.21   0.62
Oregon  -1.53   2.63   0.17

In [151]:
frame['e'].map(f1)

Utah       0.56
Ohio      -0.46
Texas      0.62
Oregon     0.17
Name: e, dtype: object

In [153]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [154]:
obj.sort_index()

a    0
b    1
c    2
d    3
dtype: int32

In [155]:
frame.sort_index()

               b         d         e
Ohio   -0.906407 -0.446376 -0.457290
Oregon -1.529371  2.633703  0.167689
Texas   0.919223 -1.212885  0.623129
Utah   -1.710557  0.202360  0.560696

In [156]:
frame.sort_index(axis='columns')

               b         d         e
Utah   -1.710557  0.202360  0.560696
Ohio   -0.906407 -0.446376 -0.457290
Texas   0.919223 -1.212885  0.623129
Oregon -1.529371  2.633703  0.167689

In [157]:
frame.sort_index(ascending=False)

               b         d         e
Utah   -1.710557  0.202360  0.560696
Texas   0.919223 -1.212885  0.623129
Oregon -1.529371  2.633703  0.167689
Ohio   -0.906407 -0.446376 -0.457290

In [158]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [159]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [160]:
obj.sort_values(ascending=False)

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [161]:
frame

               b         d         e
Utah   -1.710557  0.202360  0.560696
Ohio   -0.906407 -0.446376 -0.457290
Texas   0.919223 -1.212885  0.623129
Oregon -1.529371  2.633703  0.167689

In [163]:
frame.sort_values(by='b')

               b         d         e
Utah   -1.710557  0.202360  0.560696
Oregon -1.529371  2.633703  0.167689
Ohio   -0.906407 -0.446376 -0.457290
Texas   0.919223 -1.212885  0.623129

In [165]:
frame.sort_values(by=['d','b'])

               b         d         e
Texas   0.919223 -1.212885  0.623129
Ohio   -0.906407 -0.446376 -0.457290
Utah   -1.710557  0.202360  0.560696
Oregon -1.529371  2.633703  0.167689

In [166]:
obj.rank()

0    3.0
1    NaN
2    4.0
3    NaN
4    1.0
5    2.0
dtype: float64

In [168]:
obj.rank(method='max')

0    3.0
1    NaN
2    4.0
3    NaN
4    1.0
5    2.0
dtype: float64

In [170]:
obj= pd.Series(range(5),['a','b','a','c','a'])
obj

a    0
b    1
a    2
c    3
a    4
dtype: int64

In [173]:
obj.index.is_unique

False

In [174]:
obj.is_unique

True

In [176]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [177]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [178]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [180]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [181]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [183]:
df.idxmax()

one    b
two    d
dtype: object

In [184]:
df.idxmin()

one    d
two    b
dtype: object

In [185]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [186]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [189]:
obj = pd.Series(['a','b','b','c','a']*5,dtype='object')
obj

0     a
1     b
2     b
3     c
4     a
5     a
6     b
7     b
8     c
9     a
10    a
11    b
12    b
13    c
14    a
15    a
16    b
17    b
18    c
19    a
20    a
21    b
22    b
23    c
24    a
dtype: object

In [190]:
obj.describe()

count     25
unique     3
top        a
freq      10
dtype: object

In [192]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [200]:
data = np.random.randn(10,2)
data

array([[-0.99454135, -0.48631927],
       [ 1.01314889, -3.24241689],
       [ 1.22476045,  0.60060086],
       [ 0.98602133,  1.29451835],
       [ 1.74289237,  0.80735803],
       [-1.63541529,  1.45785883],
       [ 0.56040271,  0.06158086],
       [ 0.61068105,  0.25782884],
       [-0.1396409 , -1.00847823],
       [ 0.20534222,  1.09668786]])

In [201]:
df = pd.DataFrame(data,columns=['c','d'])
df

          c         d
0 -0.994541 -0.486319
1  1.013149 -3.242417
2  1.224760  0.600601
3  0.986021  1.294518
4  1.742892  0.807358
5 -1.635415  1.457859
6  0.560403  0.061581
7  0.610681  0.257829
8 -0.139641 -1.008478
9  0.205342  1.096688

In [202]:
df.pct_change()

          c         d
0       NaN       NaN
1 -2.018710  5.667260
2  0.208865 -1.185232
3 -0.194927  1.155372
4  0.767601 -0.376326
5 -1.938334  0.805715
6 -1.342667 -0.957759
7  0.089718  3.186834
8 -1.228664 -4.911425
9 -2.470502 -2.087468

In [204]:
df['c'].corr(df['d'])

-0.11501441991733909

In [205]:
df['c'].cov(df['d'])

-0.16759592970607098

In [206]:
df.corr()

          c         d
c  1.000000 -0.115014
d -0.115014  1.000000

In [207]:
df.cov()

          c         d
c  1.074629 -0.167596
d -0.167596  1.975894

In [208]:
df.corrwith(df['c'])

c    1.000000
d   -0.115014
dtype: float64

In [209]:
df.corrwith(df)

c    1.0
d    1.0
dtype: float64

In [210]:
obj = pd.Series(list('cadaabbcc'))
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [211]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [221]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [215]:
mask = obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [216]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object